#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>




//移位操作符
//>> - 右移操作符
// 有2种右移方式：
//    a. 算术右移
//		
//    b. 逻辑右移

//<< - 左移操作符
//移动的是二进制位
//

//>> 移动的是二进制位
//整数 - 二进制表示形式有三种：原码、反码、补码
//内存中存储这个整数的时候，存储的是补码
//正整数：原码、反码、补码 相同
//负整数：直接写的二进制序列就是原码，原码的符号位不变，其他为按位取反得到的就是反码，反码+1，得到的就是补码
//
//

//int main ()
//
//{
//	int a = 14;
//	int b = a >> 1;  //算数右移  右边丢弃 ，左边补的是原符号位      //vs采用算数右移
//	printf("%d\n", b);
//	return 0;
//
//
//}





//
//
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//把a,b两个整数交换
//	printf("a=%d b=%d\n", a, b);
//	//溢出
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//	a = a^b;                     //不创建临时变量 交换两个的值
//	b = a^b;
//	a = a^b;
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}

//int main()
//{
//	int a = 11;
//	printf("%d\n", !a);
//	return 0;
//}






//int main()
//{
//	int a = 0;
//	int arr[10] = { 0 };
//	//sizeof()-计算变量所占空间的大小
//	printf("%d\n", sizeof a );
//	printf("%d\n", sizeof(int));
//
//	printf("%d\n", sizeof(arr));//计算的数组的总大小，单位是字节
//	printf("%d\n", sizeof(int [10]));  //计算数组类型
//
//	int a = 10;
//	short s = 5;
//	printf("%d\n", sizeof(s = a + 3));
//	printf("%d\n", s);
//	return 0;
//}


//
//int main()
//{
//	int a = 0;
//	printf("%d\n", ~a);  -1
//
//	//00000000000000000000000000000000-补码
//	//11111111111111111111111111111111-补码
//	//11111111111111111111111111111110-反码
//	//10000000000000000000000000000001-原码
//
//	return 0;
//}




//int main()
//{
//	int a = 13;
//	a = a | (1 << 4);     //按位与  按位或
//	printf("%d\n", a);
//	a &= (~(1 << 4));
//	printf("%d\n", a);
//
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000   |     1<<4
//	//--------------------------------------
//	//00000000000000000000000000011101
//	//11111111111111111111111111101111   &
//	//00000000000000000000000000001101
//	//
//	return 0;
//}



//int main()
//{
//	int a = 0;
//	int b = 0;
//	//int c = a&&b;
//	int c = a || b;   //逻辑与 逻辑或 结果是1 0 真假
//	printf("%d\n", c);
//
//	return 0;
//}



//#include <string.h>
//
//struct Stu
//{
//	char name[20];
//	int age;
//	char tele[12];
//	char sex[5];
//};
//
//int main()
//{
//	struct Stu s = {"张三", 20, "15212345678", "男"};//s是一个结构体变量
//	//结构体变量.成员名
//	//结构体指针->成员名
//
//	//strcpy(s.name, "zhangsan");
//	//printf("%s\n", s.name);
//	struct Stu* ps= &s;
//	printf("%s\n", ps->name);
//	printf("%d\n", ps->age);
//
//	return 0;
//}


//
////关于整形提升
//int main()
//{
//	char a = 3;//截断
//	//00000000000000000000000000000011
//	//00000011-a
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111-b
//	char c = a + b;
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010
//	//10000010-c
//	//11111111111111111111111110000010-补码
//	//11111111111111111111111110000001
//	//10000000000000000000000001111110
//	//-126
//	printf("%d\n", c);//%d 打印10进制的有符号整形
//
//	return 0;
//}

